//--------------------------------------Задача 1-------------------------------------------------
//Запитати у користувача, яку кількість чисел він бажає ввести. Вивести на сторіну, кількість від'ємних чисел, кількість додатніх чисел, кількість нулів.

// var sum1=0;
// var sum2=0;
// var sum3=0;
// var num= +prompt("Кількість чисел яку ви хочете ввести");
// for (var i=1; i<=num;i++){
//     var numbers= +prompt("Введіть число","0");
//     if(numbers<0){sum2++}
//     else if (numbers==0){sum3++}
//     else if(numbers>0){sum1++}
//     else{alert("WTF???");}
    
// }

// document.write("<p style='background-color: red';>"+"Від’ємних чисел:"+sum2+"</p>");
// document.write("<p style='background-color: green';>"+"Додатніх чисел:"+sum1+"</p>");
// document.write("<p style='background-color: yellow';>"+"Нулів:"+sum3+"</p>");


//--------------------------------------Задача 2-------------------------------------------------
//Ввести з клавіатури 10 пар чисел. порівняти числа в кожній парі і надрукувати більші з них.

// for(var i=1; i<=10;i++){
//     var num1= +prompt("Перше число з пари");
//     var num2= +prompt("Друге число з пари");
//     if(num1>num2){
//         document.write("<p style='background-color: yellow';>"+"Число"+num1+"більше ніж"+num2+"</p>");
//     }
//     else if(num1<num2){
//         document.write("<p style='background-color: red';>"+"Число"+num2+"більше ніж"+num1+"</p>");
//     }
//     else if(num1==num2){
//         document.write("<p style='background-color: green';>"+"Число"+num1+"рівне числу"+num2+"</p>");
//     }
//     else {alert("Читай условия")}
// }

//--------------------------------------Задача 3-------------------------------------------------
//Дані натуральні числа від 35 до 87. Знайти і надрукувати ті з них, які при діленні на 7 дають залишок 1, 2 або 5. -->

// for(i=35;i<=87;i++){
//     if(i%7==1||i%7==2||i%7==5){
        
//         document.write("<p style='background-color: red';>"+i+"</p>");
       
//     }
// }




















